---
kind: type
id: T:Autodesk.Revit.DB.LeaderAtachement
source: html/82ed0368-6da3-53a3-8c07-4061efd0be56.htm
---
# Autodesk.Revit.DB.LeaderAtachement

Supported types of vertical attachments of a leader to a text note.

## Syntax (C#)
```csharp
public enum LeaderAtachement
```